# IsItalic Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..IsItalic Property
TextNode Class See Also
---
Indicates whether the default formatting is set to italic text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsItalic { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsItalic As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsItalic {
	bool get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace